# CloudPoint Fields

---
The CloudPoint type exposes the following members.
| Name| Description
---|---|---
| Color| The color
| X| The X coordinate
| Y| The Y coordinate
| Z| The Z coordinate
Top
#### Reference
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace